; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph3 - mode
	thermograph2 - mode
	infrared4 - mode
	spectrograph1 - mode
	spectrograph0 - mode
	spectrograph5 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star0 - direction
	Star5 - direction
	GroundStation2 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph5)
	(calibration_target instrument0 Star0)
	(supports instrument1 thermograph3)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph3)
	(supports instrument2 infrared4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
)
(:goal (and
	(have_image Phenomenon7 spectrograph5)
	(have_image Phenomenon7 infrared4)
	(have_image Planet8 thermograph2)
	(have_image Planet8 spectrograph1)
	(have_image Star9 spectrograph0)
	(have_image Star9 thermograph2)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 infrared4)
))

)

; plan
1. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 8
2. (calibrate satellite0 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 8
3. (turn_to satellite0 planet11 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet11)
   goals met: 0 of 8
4. (take_image satellite0 planet11 instrument2 infrared4)
   added: (have_image planet11 infrared4)
   goals met: 1 of 8
5. (turn_to satellite0 phenomenon7 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 8
6. (take_image satellite0 phenomenon7 instrument2 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 2 of 8
7. (turn_to satellite0 star0 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 star0)
   goals met: 2 of 8
8. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon7 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon7)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon7 instrument0 spectrograph5)
   added: (have_image phenomenon7 spectrograph5)
   goals met: 3 of 8
13. (turn_to satellite0 planet10 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet10)
   goals met: 3 of 8
14. (take_image satellite0 planet10 instrument0 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 4 of 8
15. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 8
16. (take_image satellite0 planet8 instrument0 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 5 of 8
17. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 5 of 8
18. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 6 of 8
19. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 6 of 8
20. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 6 of 8
21. (turn_to satellite0 star5 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star5)
   goals met: 6 of 8
22. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 6 of 8
23. (turn_to satellite0 planet8 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet8)
   goals met: 6 of 8
24. (take_image satellite0 planet8 instrument1 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 7 of 8
25. (turn_to satellite0 star9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star9)
   goals met: 7 of 8
26. (take_image satellite0 star9 instrument1 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 8 of 8
